# Lab 08

This week we will extend our explorations of Pandas with multiple data sources.  We will work entirely in the context of our gradebook example, building on concepts from past labs but bringing new skills for combining data that should be helpful when working on semester projects.

In [2]:
import numpy as np
import pandas as pd

gradebook2030S20 = dict() #Spring 2020

gradebook2030S20['doe123'] = {'lab1': 100, 'lab2' : 100, 'lab3' : 95, 'lab4' : 90, 'lab5' : 100, 'project1' : 100, 'project2' : 95, 'project3' : 90, 'project4' : 100}
gradebook2030S20['smith456'] = {'lab1': 100, 'lab2' : 80, 'lab3' : 70, 'lab4' : 90, 'lab5' : 100, 'project1' : 90, 'project2' : 88, 'project3' : 98, 'project4' : 100}
gradebook2030S20['jones789'] = {'lab1': 100, 'lab2' : 80, 'lab3' : 70, 'lab4' : 90, 'lab5' : 100, 'project1' : 100, 'project2' : 85, 'project3' : 90, 'project4' : 90}
gradebook2030S20['parker321'] = {'lab1': 90, 'lab2' : 85, 'lab3' : 95, 'lab4' : 90, 'lab5' : 90, 'project1' : 100, 'project2' : 78, 'project3' : 88, 'project4' : 90}
gradebook2030S20['jackson654'] = {'lab1': 80, 'lab2' : 90, 'lab3' : 70, 'lab4' : 90, 'lab5' : 100, 'project1' : 95, 'project2' : 93, 'project3' : 99, 'project4' : 95}
gradebook2030S20['reese987'] = {'lab1': 100, 'lab2' : 90, 'lab3' : 75, 'lab4' : 100, 'lab5' : 95, 'project1' : 90, 'project2' : 82, 'project3' : 92, 'project4' : 100}


gradebook2030S21 = dict()  #Spring 2021

gradebook2030S21['gfj234'] = {'lab1': 90, 'lab2' : 70, 'lab3' : 60, 'lab4' : 100, 'lab5' : 100, 'project1' : 80, 'project2' : 88, 'project3' : 90, 'project4' : 100}
gradebook2030S21['sdf345'] = {'lab1': 80, 'lab2' : 90, 'lab3' : 85, 'lab4' : 95, 'lab5' : 90, 'project1' : 70, 'project2' : 85, 'project3' : 95, 'project4' : 95}
gradebook2030S21['hkr678'] = {'lab1': 88, 'lab2' : 95, 'lab3' : 100, 'lab4' : 95, 'lab5' : 100, 'project1' : 100, 'project2' : 82, 'project3' : 94, 'project4' : 90}
gradebook2030S21['qzz123'] = {'lab1': 84, 'lab2' : 90, 'lab3' : 95, 'lab4' : 92, 'lab5' : 90, 'project1' : 87, 'project2' : 98, 'project3' : 88, 'project4' : 80}
gradebook2030S21['pdf567'] = {'lab1': 87, 'lab2' : 85, 'lab3' : 100, 'lab4' : 92, 'lab5' : 100, 'project1' : 92, 'project2' : 95, 'project3' : 80, 'project4' : 85}
gradebook2030S21['klc789'] = {'lab1': 92, 'lab2' : 100, 'lab3' : 90, 'lab4' : 88, 'lab5' : 85, 'project1' : 95, 'project2' : 88, 'project3' : 95, 'project4' : 88}


cumulativeF19GPA = dict()

cumulativeF19GPA ['doe123'] = {'gpa': 3.4, 'credits' : 24}
cumulativeF19GPA['smith456'] = {'gpa': 3.8, 'credits' : 25}
cumulativeF19GPA['jones789'] = {'gpa': 3.3, 'credits' : 24}
cumulativeF19GPA['parker321'] = {'gpa': 3.9, 'credits' : 28}
cumulativeF19GPA['jackson654'] = {'gpa': 4.0, 'credits' : 22}
cumulativeF19GPA['reese987'] = {'gpa': 3.8, 'credits' : 25}


gradebookDMSS20 = dict() #Spring 2020

gradebookDMSS20['doe123'] = {'finalGrade' : 88}
gradebookDMSS20['smith456'] = {'finalGrade' : 97}
gradebookDMSS20['jones789'] = {'finalGrade' : 98}
gradebookDMSS20['parker321'] = {'finalGrade' : 96}
gradebookDMSS20['jackson654'] = {'finalGrade' : 93}
gradebookDMSS20['reese987'] = {'finalGrade' : 95}

**import as data frame**

**Q1(a)**: Using Pandas, compare the class averages for LIS 2030 for Spring 2020 and Spring 2021 (yes, we have magic time travel powers).  You will need to build on work you did in Lab 7 to compute the weighted scores.  Please note that project 4 grades have been added to the dictionary above.  You can assume, for this exercise there are only 5 labs for the semester.

In [12]:
# DataFrame creation and Spring 2020 averages
dfGrade20 = pd.DataFrame(gradebook2030S20)
dfGrade21 = pd.DataFrame(gradebook2030S21)
dfGrade20.mean()

doe123        96.666667
smith456      90.666667
jones789      89.444444
parker321     89.555556
jackson654    90.222222
reese987      91.555556
dtype: float64

In [10]:
# Spring 2021 averages
dfGrade21.mean()

gfj234    86.444444
sdf345    87.222222
hkr678    93.777778
qzz123    89.333333
pdf567    90.666667
klc789    91.222222
dtype: float64

In [51]:
# Average of Spring 2020 and Spring 2021 respectively
classAvg1 = dfGrade20.mean().mean()
classAvg2 = dfGrade21.mean().mean()
print('Class Average 2020: ' + '%.2f' % classAvg1)
print('Class Average 2021: ' + '%.2f' % classAvg2)

Class Average 2020: 90.17
Class Average 2021: 90.27

**Q1(b):** Now that you have compared the total scores, investigate if one class did better on labs. Again, use Pandas.

In [58]:
# Set tables to just the labs
dfGrade20 = dfGrade20.loc['lab1':'lab5']
labAvg = dfGrade20.mean().mean()
dfGrade21 = dfGrade21.loc['lab1':'lab5']
labAvg2 = dfGrade21.mean().mean()
dfGrade20

      doe123  smith456  jones789  parker321  jackson654  reese987
lab1     100       100       100         90          80       100
lab2     100        80        80         85          90        90
lab3      95        70        70         95          70        75
lab4      90        90        90         90          90       100
lab5     100       100       100         90         100        95

In [59]:
dfGrade21

      gfj234  sdf345  hkr678  qzz123  pdf567  klc789
lab1      90      80      88      84      87      92
lab2      70      90      95      90      85     100
lab3      60      85     100      95     100      90
lab4     100      95      95      92      92      88
lab5     100      90     100      90     100      85

In [57]:
print('Class Lab Average 2020: ' + '%.2f' % labAvg)
print('Class Lab Average 2021: ' + '%.2f' % labAvg2)

Class Lab Average 2020: 90.17
Class Lab Average 2021: 90.27

**Q2:** Assume that these Spring 2020 students are only taking two classes this semester, compute the GPA for the Spring 2020 term.  You can assume that each class is worth 3 credit hours. Again, use Pandas.

In [60]:
df_gradebookDMSS20 = pd.DataFrame(gradebookDMSS20)
df_gradebookDMSS20T = df_gradebookDMSS20.T
df_gradebookDMSS20T

            finalGrade
doe123              88
smith456            97
jones789            98
parker321           96
jackson654          93
reese987            95

In [61]:
def calculateGPA (row):
    if(row['finalGrade'] >= 93) :
        return 4.0
    elif(row['finalGrade'] >= 90 and row['finalGrade'] < 93) :
        return 3.7
    elif(row['finalGrade'] >= 87 and row['finalGrade'] < 90) :
        return 3.3
    elif(row['finalGrade'] >= 83 and row['finalGrade'] < 87) :
        return 3.0
    elif(row['finalGrade'] >= 80 and row['finalGrade'] < 83) :
        return 2.7
    elif(row['finalGrade'] >= 77 and row['finalGrade'] < 80) :
        return 2.3
    elif(row['finalGrade'] >= 73 and row['finalGrade'] < 77) :
        return 2.0
    elif(row['finalGrade'] >= 70 and row['finalGrade'] < 73) :
        return 1.7
    elif(row['finalGrade'] >= 67 and row['finalGrade'] < 70) :
        return 1.3
    elif(row['finalGrade'] >= 65 and row['finalGrade'] < 67) :
        return 1.0
    else :
        return 0;

In [62]:
df_gradebookDMSS20T['gpa'] = df_gradebookDMSS20T.apply(lambda row: calculateGPA(row), axis=1)

In [109]:
df_gradebookDMSS20T

            finalGrade  gpa
doe123              88  3.3
smith456            97  4.0
jones789            98  4.0
parker321           96  4.0
jackson654          93  4.0
reese987            95  4.0

**Q3:** Using the cumulativeF19GPA data, compute the new GPA factoring in Spring 2020 grades. Again, use Pandas.

In [110]:
dfGPA19 = pd.DataFrame(cumulativeF19GPA)
dfGPA19T = dfGPA19.T
dfGPA19T

            gpa  credits
doe123      3.4     24.0
smith456    3.8     25.0
jones789    3.3     24.0
parker321   3.9     28.0
jackson654  4.0     22.0
reese987    3.8     25.0

In [123]:
# cumulative gpa = grade points * credits / total credit hours
dfGPA19T['New GPA'] = round((df_gradebookDMSS20T['gpa'] * 3.0) / dfGPA19T['credits'] + 3, 2)
dfGPA19T

            gpa  credits  newGPA  New GPA
doe123      3.4     24.0    3.41     3.41
smith456    3.8     25.0    3.48     3.48
jones789    3.3     24.0    3.50     3.50
parker321   3.9     28.0    3.43     3.43
jackson654  4.0     22.0    3.55     3.55
reese987    3.8     25.0    3.48     3.48

In [127]:
dfGPA20 = dfGPA19T.drop('newGPA', axis=1)

In [128]:
dfGPA20

            gpa  credits  New GPA
doe123      3.4     24.0     3.41
smith456    3.8     25.0     3.48
jones789    3.3     24.0     3.50
parker321   3.9     28.0     3.43
jackson654  4.0     22.0     3.55
reese987    3.8     25.0     3.48